INSERT INTO users(name) VALUES ('user1'), ('user2');

INSERT INTO category (name)
VALUES
    ('신발'),
    ('전자기기'),
    ('음료수');

INSERT INTO product (category_id, name, price, quantity)
VALUES
    (1, '나이키', 150000, 0),
    (1, '아디다스', 200000, 10),

    (2, '아이폰', 1900000, 0),
    (2, '맥북', 2000000, 5),

    (3, '음료1', 1000, 10),
    (3, '음료2', 1000, 10),
    (3, '음료3', 1000, 10),

    (3, '음료4', 2000, 10),
    (3, '음료5', 2000, 10),
    (3, '음료6', 2000, 10),
    (3, '음료7', 3000, 10),
    (3, '음료8', 3000, 10),
    (3, '음료9', 3000, 10),
    (3, '음료10', 4000, 10),
    (3, '음료11', 4000, 10),
    (3, '음료12', 4000, 10),
    (3, '음료13', 4000, 10),
    (3, '음료14', 5000, 10),
    (3, '음료15', 5000, 10),
    (3, '음료16', 5000, 10),
    (3, '음료17', 5000, 10),
    (3, '음료18', 6000, 10),
    (3, '음료19', 6000, 10),
    (3, '음료20', 6000, 10),
    (3, '음료21', 6000, 10);

INSERT INTO cart(user_id) VALUES (1), (2);

INSERT INTO cart_item(cart_id, product_id, quantity, unit_price)
VALUES
    (1, 1, 1, 150000),
    (1, 2, 2, 200000),
    (2, 4, 1, 2000000);
